Repository: pypi-data/pypi-mirror-277
Catalog: packages/collective.behavior.internalnumber/collective.behavior.internalnumber-0.4.tar.gz/collective.behavior.internalnumber-0.4/src/collective/behavior/internalnumber/locales/*/LC_MESSAGES/collective.behavior.internalnumber.po
Languages: fr

source: Add a text field to encode internal number.
fr: Ajoute un champ texte pour encoder un numéro interne

source: By type configuration
fr: Configuration par type de contenu

source: Default value tal expression
fr: Expression tal pour la valeur par défaut

source: Elements 'number', 'member', 'context' and 'portal' are available.
fr: Les variables 'number', 'member', 'context' et 'portal' sont utilisables.

source: Global configuration
fr: Configuration globale

source: Internal number
fr: Numéro interne

source: Internal number behavior configuration
fr: Configuration du champ numéro interne

source: Internal number field
fr: Champ numéro interne

source: Number of next content item
fr: Numéro du prochain type de contenu

source: Portal type
fr: Type de contenu

source: Portal type conf
fr: Conf par type de contenu

source: This value '${value}' is already used in ${obj}
fr: Cette valeur est déjà utilisée dans ${obj}

source: This value can be used as 'number' variable in tal expression
fr: Ce nombre peut être utilisé comme variable dans l'expression tal

source: Uniqueness
fr: Unicité
