Repository: pypi-data/pypi-mirror-277
Catalog: packages/collective.dms.batchimport/collective.dms.batchimport-1.3.1.tar.gz/collective.dms.batchimport-1.3.1/src/collective/dms/batchimport/locales/*/LC_MESSAGES/collective.dms.batchimport.po
Languages: fr

source: Batch Import
fr: Importation batch DMS

source: Batch Import Settings
fr: Configuration de l'importation batch DMS

source: Code to Portal Type Mapping
fr: Correspondance code/type de contenu

source: FS Root Directory
fr: Dossier racine d'import

source: FS Root Directory for processed files
fr: Dossier racine pour les fichiers traités

source: File
fr: Fichier

source: Import
fr: Importation

source: Installs the collective.dms.batchimport package
fr: Installation du package collective.dms.batchimport

source: Internal reference number (${irn}) already exists on type ${type}
fr: Le numero de reference interne (${irn}) existe deja pour le type ${type}

source: Mapping
fr: Correspondance

source: Portal Type
fr: Type de contenu

source: Scanned Mail
fr: Document scanné

source: Steps to ease tests of collective.dms.batchimport
fr: Steps pour faciliter les tests de collective.dms.batchimport
