Repository: pypi-data/pypi-mirror-277
Catalog: packages/libretranslate/libretranslate-1.6.0.tar.gz/libretranslate-1.6.0/libretranslate/locales/*/LC_MESSAGES/messages.po
Languages: be

source: Invalid JSON format
be: Памылковы JSON-фармат

source: Auto Detect
be: Аўтавызначэнне

source: Unauthorized
be: Патрэбна аўтарызацыя

source: Too many request limits violations
be: Перавышаны ліміт запытаў

source: Invalid API key
be: Памылковы API ключ

source: Please contact the server operator to get an API key
be: Калі ласка звяжыцеся з аператарам сэрверу каб атрымаць API ключ

source: Visit %(url)s to get an API key
be: Наведайце %(url)s каб атрымаць API ключ

source: Slowdown:
be: Запаволенне:

source: Invalid request: missing %(name)s parameter
be: Памылковы запыт: параметар %(name)s адсутнічае

source: Invalid request: request (%(size)s) exceeds text limit (%(limit)s)
be: Памылковы запыт: запыт (%(size)s) перавышае дазволены ліміт тэксту (%(limit)s)

source: %(lang)s is not supported
be: %(lang)s не падтрымліваецца

source: %(format)s format is not supported
be: Фармат %(format)s не падтрымліваеецца

source: %(tname)s (%(tcode)s) is not available as a target language from %(sname)s (%(scode)s)
be: %(tname)s (%(tcode)s) не даступная як мова перакладу з %(sname)s (%(scode)s)

source: Cannot translate text: %(text)s
be: Не атрымалася перакласці тэкст: %(text)s

source: Files translation are disabled on this server.
be: Переклад файлаў вымкнуты на гэтым сэрвере.

source: Invalid request: empty file
be: Памылковы запыт: пусты файл

source: Invalid request: file format not supported
be: Памылковы запыт: фармат файла не падтрымліваецца

source: Invalid filename
be: Няслушная назва файла

source: Suggestions are disabled on this server.
be: Прапанаванні выключаны на гэтым сэрверы.

source: English
be: Англійская

source: Arabic
be: Арабская

source: Azerbaijani
be: Азербайджанская

source: Chinese
be: Кітайская

source: Czech
be: Чешская

source: Danish
be: Дацкая

source: Dutch
be: Нідэрландская

source: Esperanto
be: Эсперанта

source: Finnish
be: Фінская

source: French
be: Французская

source: German
be: Нямецкая

source: Greek
be: Грэчаская

source: Hebrew
be: Іўрыт

source: Hindi
be: Хіндзі

source: Hungarian
be: Венгерская

source: Indonesian
be: Інданезійская

source: Irish
be: Ірландская

source: Italian
be: Італьянская

source: Japanese
be: Японская

source: Korean
be: Карэйская

source: Persian
be: Персідская

source: Polish
be: Польская

source: Portuguese
be: Партугальская

source: Russian
be: Руская

source: Slovak
be: Славацкая

source: Spanish
be: Іспанская

source: Swedish
be: Шведская

source: Turkish
be: Турэцкая

source: Ukranian
be: Украінская

source: Vietnamese
be: В’етнамская

source: Retrieve list of supported languages
be: Атрымаць спіс падтрыманых моў

source: List of languages
be: Спіс моў

source: translate
be: пераклад

source: Translate text from a language to another
be: Перакласць тэкст з адной мовы на іншую

source: Translated text
be: Перакладзены тэкст

source: Invalid request
be: Памылковы запыт

source: Translation error
be: Памылка перакладу

source: Slow down
be: Запаволенне

source: Banned
be: Заблакавана

source: Hello world!
be: Прывітанне, свет!

source: Text(s) to translate
be: Тэкст(а) для перакладу

source: Source language code
be: Код мовы арыгінала

source: Target language code
be: Код мовы пераклада

source: text
be: тэкст

source: Format of source text: * `text` - Plain text * `html` - HTML markup
be: Фармат выточнага тэксту: * `text` - Звычайны тэкст * `html` - HTML-разметка

source: API key
be: API ключ

source: Translate file from a language to another
be: Перакласць файл з адной мовы на іншую

source: Translated file
be: Перакладзены файл

source: File to translate
be: Файл для перакладу

source: Detect the language of a single text
be: Вызначыць мову аднаго тэксту

source: Detections
be: Вызначэння

source: Detection error
be: Памылка вызначэння

source: Text to detect
be: Тэкст для вызначэння

source: Retrieve frontend specific settings
be: Атрымаць налады для інтэрфэйсу

source: frontend settings
be: налады інтэрфэйсу

source: frontend
be: інтэрфейс

source: Submit a suggestion to improve a translation
be: Запрапанаваць як палепшыць пераклад

source: Success
be: Поспех

source: Not authorized
be: Не аўтаразаваны

source: Original text
be: Арыгінальны тэкст

source: Suggested translation
be: Запрапанаваны пераклад

source: Language of original text
be: Мова арыгінальнага тэкста

source: Language of suggested translation
be: Мова прапанаванага перакладу

source: feedback
be: зваротная сувязь

source: Language code
be: Код мовы

source: Human-readable language name (in English)
be: Чалавекачытальная назва мовы (па-ангельску)

source: Supported target language codes
be: Коды падтрымліваемых моў

source: Translated text(s)
be: Перакладзены(-я) тэкст(-а)

source: Error message
be: Паведамленне пра абмылу

source: Reason for slow down
be: Прычына запаволення

source: Translated file url
be: URL-адрэса перакладзенага файла

source: Confidence value
be: Ровень упэўненасці

source: Character input limit for this language (-1 indicates no limit)
be: Абмежаванне колькаскі знакаў для гэтай мовы (-1 азначае адсутнасць абмежаванняў)

source: Frontend translation timeout
be: Час перакладу інтэрфэйсу перавышаны

source: Whether the API key database is enabled.
be: Ці увамкнёная база дадзеных API ключоў.

source: Whether an API key is required.
be: Ці патрэбен API ключ.

source: Whether submitting suggestions is enabled.
be: Ці ўвамкненна магчымасць адпраўляць прапановы.

source: Supported files format
be: Падтрымліваемыя фарматы файлаў

source: Whether submission was successful
be: Ці было адсыланне паспяховым

source: Copy text
be: Скапіяваць тэкст

source: Cannot load %(url)s
be: Немагчыма спампаваць %(url)s

source: Unknown error
be: Невядомая памылка

source: Copied
be: Скапіявана

source: Thanks for your correction. Note the suggestion will not take effect right away.
be: Дзякуй за вашу заўвагу. Прыміце да ўвагі: Ваша прапанова не адразу набудзе моц.

source: No languages available. Did you install the models correctly?
be: Няма даступных моў. Вы слушна ўсталявалі мадэлі?

source: Type in your API Key. If you need an API key, %(instructions)s
be: Увядзіце ваш API ключ. Калі вам патрэбен API ключ, %(instructions)s

source: press the "Get API Key" link.
be: націсніце на спасылку "Атрымаць API ключ".

source: contact the server operator.
be: звяжыцеся з аператарам сэрвера.

source: Free and Open Source Machine Translation API
be: Бясплатнае API для машыннага перакладу з адкрытым выточным кодам

source: translation
be: пераклад
